VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F85x_86x/SPI/F85x_SPI0_EEPROM_Polled_Mode.c
//-----------------------------------------------------------------------------
// F85x_SPI0_EEPROM_Polled_Mode.c
//-----------------------------------------------------------------------------
// Copyright 2013 Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
//
// This program accesses a SPI EEPROM using polled mode access. The MCU
// is configured in 4-wire Single Master Mode, and the EEPROM is the only
// slave device connected to the SPI bus. The read/write operations are
// tailored to access a Microchip 4 kB EEPROM 25LC320. The relevant hardware
// connections of the MCU are shown here:
//
// P0.0 - SPI SCK    (digital output, push-pull)
// P0.1 - SPI MISO   (digital input, open-drain)
// P0.2 - SPI MOSI   (digital output, push-pull)
// P0.3 - SPI NSS    (digital output, push-pull)
// P0.4 - UART TXD   (digital output, push-pull)
// P0.5 - UART RXD   (digital input, open-drain)
//
// P1.0 - LED1       (digital output, push-pull)
//
// How To Test:
//
// Method1:
// 1) Ensure shorting blocks are place on the following:
//    - J27: DS5 P1.0 - P1.0
//    - JP2
// 2) Connect the device to a SPI EEPROM.
// 3) Place the SW1 switch in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 4) Compile and download code to the 'F85x UDP MCU board.
// 5) Run the code. The LED will blink fast during the write/read/verify
//    operations.
// 6) If the verification passes, the LED will blink slowly. If it fails,
//    the LED will be off.
//
// Method2 (optional):
// 1) Ensure shorting blocks are place on the following:
//    - J27: DS5 P1.0 - P1.0
//    - J7: all
//    - JP2
// 2) Connect the device to a SPI EEPROM.
// 3) Place the SW1 switch in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 4) Compile and download code to the 'F85x UDP MCU board.
// 5) Connect a USB cable from the J5 of the MCU card to a PC.
// 6) On the PC, open HyperTerminal (or any other terminal program) and connect
//    to the USB port (virtual COM port) at <BAUDRATE> (230400) and 8-N-1.
// 7) Run the code. The terminal will print the progress of the write/read
//    operation and will print the test result as pass or fail. Additionally,
//    if the verification passes, the DS5 P1.0 LED will blink slowly. If it
//    fails, the LED will be off.
//
//
// Target:         C8051F85x/86x
// Tool chain:     Generic
// Command Line:   None
//
// Release 1.1 (TP)
//    - Updated descriptions and comments
//    - 24 JUL 2013
//
// Release 1.0
//    - Initial Revision (TP)
//    - 25 FEB 2013
//

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------

#include <compiler_defs.h>
#include <C8051F850_defs.h>            // SFR declarations
#include <stdio.h>                     // printf is declared here

//-----------------------------------------------------------------------------
// Global Constants
//-----------------------------------------------------------------------------

#define SYSCLK                24500000 // Internal oscillator frequency in Hz
#define BAUDRATE                230400 // Baud rate of UART in bps

// Microchip 25AA320 Slave EEPROM Parameters
#define  F_SCK_MAX             2000000 // Max SCK freq (Hz)
#define  T_NSS_DISABLE_MIN         500 // Min NSS disable time (ns)
#define  EEPROM_CAPACITY          4096 // EEPROM capacity (bytes)

// EEPROM Instruction Set
#define  EEPROM_CMD_READ          0x03 // Read Command
#define  EEPROM_CMD_WRITE         0x02 // Write Command
#define  EEPROM_CMD_WRDI          0x04 // Reset Write Enable Latch Command
#define  EEPROM_CMD_WREN          0x06 // Set Write Enable Latch Command
#define  EEPROM_CMD_RDSR          0x05 // Read Status Register Command
#define  EEPROM_CMD_WRSR          0x01 // Write Status Register Command

//-----------------------------------------------------------------------------
// Pin Definitions
//-----------------------------------------------------------------------------

SBIT (LED1, SFR_P1, 0);                // DS5 P1.0 LED

#define LED_ON                       0
#define LED_OFF                      1

//-----------------------------------------------------------------------------
// Function Prototypes
//-----------------------------------------------------------------------------

void Oscillator_Init (void);
void Port_Init (void);
void Timer2_Init (void);
void UART0_Init (void);
void SPI0_Init (void);

void Delay_us (U8 time_us);
void Delay_ms (U8 time_ms);
void EEPROM_Write (U16 address, U8 value);
U8 EEPROM_Read (U16 address);

//-----------------------------------------------------------------------------
// main() Routine
//-----------------------------------------------------------------------------
void main (void)
{
   U16 address;                        // EEPROM address
   U8 test_byte;                       // Used as a temporary variable

   // Disable the watchdog timer
   WDTCN = 0xDE;
   WDTCN = 0xAD;

   Oscillator_Init ();
   Timer2_Init ();
   UART0_Init ();
   SPI0_Init ();
   Port_Init ();                       // Port init should come after SPI init
                                       // for 3-wire or 4-wire selection

   // The following code will test the EEPROM by performing write/read/verify
   // operations. The first test will write 0xFFs to the EEPROM, and the
   // second test will write the LSBs of the EEPROM addresses.

   // Fill EEPROM with 0xFF's
   LED1 = LED_ON;
   printf("Filling with 0xFF's...\n");
   for (address = 0; address < EEPROM_CAPACITY; address++)
   {
      test_byte = 0xFF;
      EEPROM_Write (address, test_byte);

      // Print status to UART0
      if ((address % 16) == 0)
      {
         printf ("\nWriting 0x%04x: %02x ", address, (U16)test_byte);
         LED1 = !LED1;
      }
      else
      {
         printf ("%02x ", (U16)test_byte);
      }
   }

   // Verify EEPROM with 0xFF's
   printf("\n\nVerifying 0xFF's...\n");
   for (address = 0; address < EEPROM_CAPACITY; address++)
   {
      test_byte = EEPROM_Read (address);

      // Print status to UART0
      if ((address % 16) == 0)
      {
         printf ("\nVerifying 0x%04x: %02x ", address, (U16)test_byte);
         LED1 = !LED1;
      }
      else
      {
         printf ("%02x ", (U16)test_byte);
      }

      if (test_byte != 0xFF)
      {
         LED1 = LED_OFF;
         printf ("Error at %u\n", address);
         while(1);                     // Stop here on error (for debugging)
      }
   }

   // Fill EEPROM with LSB of EEPROM addresses
   printf("\n\nFilling with LSB of EEPROM addresses...\n");
   for (address = 0; address < EEPROM_CAPACITY; address++)
   {
      test_byte = address & 0xFF;
      EEPROM_Write (address, test_byte);

      // Print status to UART0
      if ((address % 16) == 0)
      {
         printf ("\nWriting 0x%04x: %02x ", address, (U16)test_byte);
         LED1 = !LED1;
      }
      else
      {
         printf ("%02x ", (U16)test_byte);
      }
   }

   // Verify EEPROM with LSB of EEPROM addresses
   printf("\n\nVerifying LSB of EEPROM addresses...\n");
   for (address = 0; address < EEPROM_CAPACITY; address++)
   {
      test_byte = EEPROM_Read (address);

      // print status to UART0
      if ((address % 16) == 0)
      {
         printf ("\nVerifying 0x%04x: %02x ", address, (U16)test_byte);
         LED1 = !LED1;
      }
      else
      {
         printf ("%02x ", (U16)test_byte);
      }

      if (test_byte != (address & 0xFF))
      {
         LED1 = LED_OFF;
         printf ("Error at %u\n", address);
         while(1);                     // Stop here on error (for debugging)
      }
   }

   printf ("\n\nVerification success!\n");

   while (1)                           // Loop forever
   {
      LED1 = !LED1;                    // Flash LED when done (all verified)
      Delay_ms (200);
   }
}

//-----------------------------------------------------------------------------
// Initialization Subroutines
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Oscillator_Init
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// This function initializes the system clock to use the internal oscillator
// at 24.5 MHz.
//
//-----------------------------------------------------------------------------
void Oscillator_Init (void)
{
   CLKSEL = 0x00;                      // Set system clock to 24.5 MHz
}

//-----------------------------------------------------------------------------
// Port_Init
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// This function configures the crossbar and GPIO ports.
//
// P0.0  -  SCK  (SPI0), Push-Pull,  Digital
// P0.1  -  MISO (SPI0), Open-Drain, Digital
// P0.2  -  MOSI (SPI0), Push-Pull,  Digital
// P0.3  -  NSS  (SPI0), Push-Pull,  Digital
// P0.4  -  TX0  (UART0), Push-Pull, Digital
// P0.5  -  RX0  (UART0), Open-Drain, Digital
//
// P1.0  -  Skipped,     Push-Pull,  Digital (LED on Target Board)
//
//-----------------------------------------------------------------------------
void Port_Init(void)
{
   P0MDOUT = 0x0D;                     // Make SCK, MOSI, and NSS push-pull

   P0MDOUT |= 0x10;                    // Make TX0 push-pull

   P1MDOUT = 0x01;                     // Make the LED push-pull
   P1SKIP = 0x01;                      // Skip the LED (P1.0)

   XBR0 |= 0x02;                       // Enable SPI pins
   XBR0 |= 0x01;                       // Enable UART on P0.4(TX) and P0.5(RX)
   XBR2 = 0x40;                        // Enable the XBAR and weak pull-ups
}

//-----------------------------------------------------------------------------
// Timer2_Init
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// Initializes Timer2 to be clocked by SYSCLK for use as a delay timer.
//
//-----------------------------------------------------------------------------
void Timer2_Init(void)
{
   CKCON |= 0x10;
}

//-----------------------------------------------------------------------------
// UART0_Init
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// Configures the UART0 using Timer1, for <BAUDRATE> and 8-N-1. Once this is
// set up, the standard printf function can be used to output data.
//
//-----------------------------------------------------------------------------
void UART0_Init(void)
{
   SCON0 = 0x10;                       // SCON0: 8-bit variable bit rate
                                       //        level of STOP bit is ignored
                                       //        RX enabled
                                       //        ninth bits are zeros
                                       //        clear RI0 and TI0 bits
   #if (SYSCLK/BAUDRATE/2/256 < 1)
      TH1 = -(SYSCLK/BAUDRATE/2);
      CKCON &= ~0x0B;                  // T1M = 1; SCA1:0 = xx
      CKCON |=  0x08;
   #elif (SYSCLK/BAUDRATE/2/256 < 4)
      TH1 = -(SYSCLK/BAUDRATE/2/4);
      CKCON &= ~0x0B;                  // T1M = 0; SCA1:0 = 01
      CKCON |=  0x01;
   #elif (SYSCLK/BAUDRATE/2/256 < 12)
      TH1 = -(SYSCLK/BAUDRATE/2/12);
      CKCON &= ~0x0B;                  // T1M = 0; SCA1:0 = 00
   #else
      TH1 = -(SYSCLK/BAUDRATE/2/48);
      CKCON &= ~0x0B;                  // T1M = 0; SCA1:0 = 10
      CKCON |=  0x02;
   #endif

   TL1 = TH1;                          // Init Timer1
   TMOD &= ~0xf0;                      // TMOD: timer 1 in 8-bit autoreload
   TMOD |=  0x20;
   TR1 = 1;                            // START Timer1
   TI = 1;                             // Indicate TX0 ready
}

//-----------------------------------------------------------------------------
// SPI0_Init
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// Configures SPI0 to use 4-wire Single-Master mode. The SPI timing is
// configured for Mode 0,0 (data centered on first edge of clock phase and
// SCK line low in idle state). The SPI clock is set to 1.75 MHz. The NSS pin
// is set to 1.
//
//-----------------------------------------------------------------------------
void SPI0_Init(void)
{
   SPI0CFG = 0x40;                     // Master mode, mode 0,0 for
                                       // phase/polarity
   SPI0CN = 0x0C;                      // 4-wire mode

   // The equation for SPI0CKR is (SYSCLK/(2*F_SCK_MAX))-1, which yields
   // a SPI frequency that is slightly more than 2 MHz. But, 2 MHz is the max
   // frequency spec of the EEPROM used here. So, the "-1" term is omitted
   // in the following usage:
   SPI0CKR = (SYSCLK/(2*F_SCK_MAX));

   SPI0CN |= 0x01;                     // Enable the SPI module
}

//-----------------------------------------------------------------------------
// Support Subroutines
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Delay_us
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : 1. time_us - time delay in microseconds
//                   range: 1 to 255
//
// Creates a delay for the specified time (in microseconds) using TIMER2. The
// time tolerance is approximately +/-50 ns (1/SYSCLK + function call time).
//
//-----------------------------------------------------------------------------
void Delay_us (U8 time_us)
{
   TR2 = 0;                            // Stop timer
   TF2H = 0;                           // Clear timer overflow flag
   TMR2 = -( (U16)(SYSCLK/1000000) * (U16)(time_us) );
   TR2 = 1;                            // Start timer
   while(!TF2H);                       // Wait till timer overflow occurs
   TR2 = 0;                            // Stop timer
}

//-----------------------------------------------------------------------------
// Delay_ms
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : 1. time_ms - time delay in milliseconds
//                   range: 1 to 255
//
// Creates a delay for the specified time (in milliseconds) using TIMER2. The
// time tolerance is approximately +/-50 ns (1/SYSCLK + function call time).
//
//-----------------------------------------------------------------------------
void Delay_ms (U8 time_ms)
{
   U8 i;

   while(time_ms--)
   {
      for(i = 0; i< 10; i++)           // 10 * 100 microsecond delay
      {
         Delay_us (100);
      }
   }
}

//-----------------------------------------------------------------------------
// EEPROM_Write
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : 1. address - the destination EEPROM address.
//                   range: 0 to EEPROM_CAPACITY
//                2. value - the value to write.
//                   range: 0x00 to 0xFF
//
// Writes one byte to the specified address in the EEPROM. This function polls
// the EEPROM status register after the write operation, and returns only after
// the status register indicates that the write cycle is complete. This is to
// prevent from having to check the status register before a read operation.
//
//-----------------------------------------------------------------------------
void EEPROM_Write (U16 address, U8 value)
{
   // Writing a byte to the EEPROM is a five-step operation.

   // Step1: Set the Write Enable Latch to 1
   NSSMD0 = 0;                         // Step1.1: Activate Slave Select
   SPI0DAT = EEPROM_CMD_WREN;          // Step1.2: Send the WREN command
   while(!SPIF);                       // Step1.3: Wait for end of transfer
   SPIF = 0;                           // Step1.4: Clear the SPI intr. flag
   NSSMD0 = 1;                         // Step1.5: Deactivate Slave Select
   Delay_us (1);                       // Step1.6: Wait for at least
                                       //    T_NSS_DISABLE_MIN
   // Step2: Send the WRITE command
   NSSMD0 = 0;
   SPI0DAT = EEPROM_CMD_WRITE;
   while(!SPIF);
   SPIF = 0;

   // Step3: Send the EEPROM destination address (MSB first)
   SPI0DAT = (U8)((address >> 8) & 0x00FF);
   while(!SPIF);
   SPIF = 0;
   SPI0DAT = (U8)(address & 0x00FF);
   while(!SPIF);
   SPIF = 0;

   // Step4: Send the value to write
   SPI0DAT = value;
   while(!SPIF);
   SPIF = 0;
   NSSMD0 = 1;
   Delay_us(1);

   // Step5: Poll on the Write In Progress (WIP) bit in Read Status Register
   do
   {
      NSSMD0 = 0;                      // Activate Slave Select
      SPI0DAT = EEPROM_CMD_RDSR;       // Send the Read Status Register command
      while(!SPIF);                    // Wait for the command to be sent out
      SPIF = 0;
      SPI0DAT = 0;                     // Dummy write to output serial clock
      while(!SPIF);                    // Wait for the register to be read
      SPIF = 0;
      NSSMD0 = 1;                      // Deactivate Slave Select after read
      Delay_us (1);
   } while((SPI0DAT & 0x01) == 0x01);
}

//-----------------------------------------------------------------------------
// EEPROM_Read
//-----------------------------------------------------------------------------
//
// Return Value : The value that was read from the EEPROM
//                   range: 0x00 to 0xFF
// Parameters   : 1. address - the source EEPROM address.
//                   range: 0 to EEPROM_CAPACITY
//
// Reads one byte from the specified EEPROM address.
//
//-----------------------------------------------------------------------------
U8 EEPROM_Read (U16 address)
{
   // Reading a byte from the EEPROM is a three-step operation.

   // Step1: Send the READ command
   NSSMD0 = 0;                         // Activate Slave Select
   SPI0DAT = EEPROM_CMD_READ;
   while(!SPIF);
   SPIF = 0;

   // Step2: Send the EEPROM source address (MSB first)
   SPI0DAT = (U8)((address >> 8) & 0x00FF);
   while(!SPIF);
   SPIF = 0;
   SPI0DAT = (U8)(address & 0x00FF);
   while(!SPIF);
   SPIF = 0;

   // Step3: Read the value returned
   SPI0DAT = 0;                        // Dummy write to output serial clock
   while(!SPIF);                       // Wait for the value to be read
   SPIF = 0;
   NSSMD0 = 1;                         // Deactivate Slave Select
   Delay_us (1);

   return SPI0DAT;
}

//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------
